Feature: Вход в системата.

  Background: 
    Given Отваря екрана за вход в системата.

  Scenario: Вход в системата с валидни потребителски данни.
    When Въведе потребителско име: "Преслав".
    And въведе валидна потребителска парола.
    And натисне бутона за вход в системата.
    Then Вижда съобщение за успешен вход.

  Scenario: Вход в системата без парола.
    When Въведе потребителско име: "Преслав".
    And натисне бутона за вход в системата.
    Then Вижда съобщение за липсващи данни.

  Scenario: Вход в системата без потребителско име.
    When въведе валидна потребителска парола.
    And натисне бутона за вход в системата.
    Then Вижда съобщение за липсващи данни.

  Scenario: Вход в системата без данни.
    When натисне бутона за вход в системата.
    Then Вижда съобщение за липсващи данни.

  Scenario: Вход в системата с невалидни потребителски данни.
    When Въведе потребителско име: "Wrong username".
    And въведе валидна потребителска парола.
    And натисне бутона за вход в системата.
    Then Вижда съобщение за грешни данни.
