Feature: Регистрация на потребител

  Scenario Outline: Регистрация на потребител
    Given Потребителят отваря екрана за регистрация на нов потребител
    When Въведе потребителско име: "<потребителско име>"
    And Въведе парола: "<парола>"
    And Въведе повторно парола: "<парола2>"
    And Въведе електронна поща: "<email>"
    And Натисне бутона за регистрация
    Then Вижда съобщение "<Съобщение>"

    Examples: 
      | потребителско име | парола    | парола2   | email         | Съобщение               |
      
      | Реджеп            | redzhep00 | redzhep00 | redjep@abv.bg | Успешна регистрация     |
      | Реджеп            | redzhep00 | redzhep   | redjep@abv.bg | Въведете еднакви пароли |
      |                   | redzhep00 | redzhep00 | redjep@abv.bg | Въведете име            |
